app/controllers/comments_controller.rb

def create
  @comment = @daily.comments.build(comment_params)

  respond_to do |format|
    if @comment.save
---
INSERT INTO "comments" ("content", "daily_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "sss"], ["daily_id", 1], ["created_at", "2024-11-14 22:55:00.606343"], ["updated_at", "2024-11-14 22:55:00.606343"]]

  def set_daily
    @daily = Daily.find_by(id: params[:daily_id])
---
SELECT "dailies".* FROM "dailies" WHERE "dailies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]