app/controllers/dailies_controller.rb

  def index
    @dailies = Daily.all
---
SELECT "dailies".* FROM "dailies"

  def create
    @daily = Daily.new(daily_params)

    respond_to do |format|
      if @daily.save
---
INSERT INTO "dailies" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "welcome"], ["content", "ssdsdds"], ["created_at", "2024-11-14 16:12:51.068504"], ["updated_at", "2024-11-14 16:12:51.068504"]]

  def set_daily
    @daily = Daily.find_by(id: params[:id])
---
SELECT "dailies".* FROM "dailies" WHERE "dailies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]